Revit 2026 API

# DGNExportOptionsGetPredefinedSetupNames Method

---

Returns a list of names of predefined setups of DGN export options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<string> GetPredefinedSetupNames(
	Document document
)
```
```vb
Public Shared Function GetPredefinedSetupNames (
	document As Document
) As IList(Of String)
```
```cpp
public:
static IList<String^>^ GetPredefinedSetupNames(
	Document^ document
)
```
```fsharp
static member GetPredefinedSetupNames :
        document : Document -> IList<string>
```

#### Parameters

document Document
     A Revit document to retrieve names from.

#### Return Value

IListString An array of strings representing names of predefined setups.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non-optional argument was null |

To get predefined options in the desired format use the static method getPredefinedOptions defined in DGNExportOptions.

#### Reference

DGNExportOptions Class

Autodesk.Revit.DB Namespace